/*
 *	Copyright (C) 2011 Alex009
 *	License read in license.txt
 */

#include "SAMP/CSAMP.h"
#include "defines.h"

float WeaponsDamage[MAX_WEAPONS + 2] = 
{
	1.0, // кулаки
	5.0, // кастет
	5.0, // клюшка
	5.0, // дубинка
	15.0, // нож
	10.0, // бита
	10.0, // лопата
	10.0, // кий
	30.0, // катана
	40.0, // пила
	10.0, // дилдо
	10.0, // дилдо 2
	10.0, // вибро
	10.0, // вибро 2
	10.0, // цветы
	10.0, // хз
	75.0, // гранаты
	0.0, // дымовухи
	75.0, // молотов
	0.0, // нету
	0.0, // нету
	0.0, // нету
	25.0, // кольт
	40.0, // глушак
	70.0, // дигл
	10.0, // шот
	10.0, // обрез
	15.0, // спас
	20.0, // uzi
	20.0, // mp5
	30.0, // ak47
	30.0, // m4
	25.0, // tec9
	75.0, // винтовка
	125.0, // снайперка
	75.0, // ракетница
	75.0, // ракетница
	25.0, // огнемёт
	140.0, // миниган
	75.0, // чтото
	50.0, // бомба
	1.0, // балончик
	1.0, // огнетушитель
	0.0, // камера
	0.0, // нету
	0.0, // нету
	0.0, // парашут
	50.0 // взрыв ракеты
};

int WeaponsReloadTime[MAX_WEAPONS + 1] = 
{
	100, // кулаки
	100, // кастет
	100, // клюшка
	100, // дубинка
	100, // нож
	100, // бита
	100, // лопата
	100, // кий
	100, // катана
	50, // пила
	100, // дилдо
	100, // дилдо 2
	100, // вибро
	100, // вибро 2
	100, // цветы
	100, // хз
	0, // гранаты
	0, // дымовухи
	0, // молотов
	0, // нету
	0, // нету
	0, // нету
	20, // кольт
	30, // глушак
	63, // дигл
	50, // шот
	7, // обрез
	25, // спас
	5, // uzi
	9, // mp5
	15, // ak47
	10, // m4
	5, // tec9
	25, // винтовка
	10, // снайперка
	500, // ракетница
	500, // ракетница
	100, // огнемёт
	5, // миниган
	100, // чтото
	100, // бомба
	5, // балончик
	5, // огнетушитель
	100, // камера
	100, // нету
	100, // нету
	100 // парашут
};